app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "3"]]
---
  def edit
    #debugger
    @movie = Movie.find params[:id]

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "3"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" IS NULL LIMIT 1
---
  def samedirector
    #debugger
    id = params[:movie_id] # retrieve movie ID from URI route
    movie = Movie.find(id) # look up movie by unique ID
    @director = movie.director
    if @director == ""
      flash[:notice] = "'#{movie.title}' has no director info."
      redirect_to movies_path
    else
      @movies = Movie.find_all_by_director(@director)